upload_performance_result/metrics/sglang/20260730/test_npu_mimo_v2_flash_1p1d_12p_in32k_out1_ttft_5s__20260730.txt
memfabric_hybrid          1.0.8
sgl_kernel_npu            2026.6.1
sglang                    0.5.17.dev331+ge1f2f9d1f       /sgl-workspace/sglang/python
sglang-router             0.3.2
torch                     2.10.0+cpu
torch_npu                 2.10.0
torchao                   0.9.0
torchaudio                2.10.0+cpu
torchvision               0.25.0+cpu
CANN: 9.0.0
transformers: 5.12.1
can not use command: npu-smi info
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
[transformers] You are using a model of type `mimo_v2_flash` to instantiate a model of type ``. This may be expected if you are loading a checkpoint that shares a subset of the architecture (e.g., loading a `sam2_video` checkpoint into `Sam2Model`), but is otherwise not supported and can yield errors. Please verify that the checkpoint is compatible with the model you are instantiating.
/usr/local/python3.11.15/lib/python3.11/site-packages/transformers/modeling_rope_utils.py:1036: FutureWarning: `rope_config_validation` is deprecated and has been removed. Its functionality has been moved to RotaryEmbeddingConfigMixin.validate_rope method. PreTrainedConfig inherits this class, so please call self.validate_rope() instead. Also, make sure to use the new rope_parameters syntax. You can call self.standardize_rope_params() in the meantime.
  warnings.warn(
[transformers] You are using a model of type `mimo_v2_flash` to instantiate a model of type ``. This may be expected if you are loading a checkpoint that shares a subset of the architecture (e.g., loading a `sam2_video` checkpoint into `Sam2Model`), but is otherwise not supported and can yield errors. Please verify that the checkpoint is compatible with the model you are instantiating.
benchmark_args=Namespace(backend='sglang', base_url=None, host='172.22.3.138', port=6677, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/iridiumine/MiMo-V2-Flash-W8A8', served_model_name=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=32000, random_output_len=1, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.4, use_trace_timestamps=False, max_concurrency=64, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://172.22.3.138:6677/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='172.22.3.138', port=6677, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/iridiumine/MiMo-V2-Flash-W8A8', served_model_name=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=32000, random_output_len=1, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.4, use_trace_timestamps=False, max_concurrency=64, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 4096000
#Output tokens: 128
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/128 [00:00<?, ?it/s]
  1%|          | 1/128 [00:06<13:30,  6.39s/it]
  2%|▏         | 2/128 [00:06<05:39,  2.70s/it]
  2%|▏         | 3/128 [00:08<04:34,  2.20s/it]
  3%|▎         | 4/128 [00:08<02:55,  1.42s/it]
  4%|▍         | 5/128 [00:09<02:51,  1.39s/it]
  5%|▍         | 6/128 [00:09<01:56,  1.04it/s]
  5%|▌         | 7/128 [00:11<02:14,  1.11s/it]
  6%|▋         | 8/128 [00:13<03:16,  1.64s/it]
  8%|▊         | 10/128 [00:14<01:51,  1.06it/s]
  9%|▊         | 11/128 [00:15<01:57,  1.00s/it]
  9%|▉         | 12/128 [00:18<03:03,  1.59s/it]
 10%|█         | 13/128 [00:21<03:47,  1.98s/it]
 11%|█         | 14/128 [00:22<03:13,  1.70s/it]
 12%|█▏        | 15/128 [00:23<02:35,  1.38s/it]
 12%|█▎        | 16/128 [00:24<02:40,  1.43s/it]
 13%|█▎        | 17/128 [00:26<02:38,  1.43s/it]
 14%|█▍        | 18/128 [00:26<02:07,  1.16s/it]
 15%|█▍        | 19/128 [00:28<02:37,  1.44s/it]
 16%|█▌        | 20/128 [00:30<02:35,  1.44s/it]
 16%|█▋        | 21/128 [00:30<02:00,  1.12s/it]
 17%|█▋        | 22/128 [00:33<03:00,  1.70s/it]
 18%|█▊        | 23/128 [00:42<06:36,  3.78s/it]
 19%|█▉        | 24/128 [00:43<05:05,  2.94s/it]
 20%|█▉        | 25/128 [00:46<05:00,  2.92s/it]
 20%|██        | 26/128 [00:51<06:10,  3.63s/it]
 21%|██        | 27/128 [00:57<07:10,  4.26s/it]
 22%|██▏       | 28/128 [00:57<05:06,  3.06s/it]
 23%|██▎       | 29/128 [00:58<04:07,  2.50s/it]
 23%|██▎       | 30/128 [00:58<02:58,  1.82s/it]
 24%|██▍       | 31/128 [01:03<04:09,  2.57s/it]
 25%|██▌       | 32/128 [01:03<02:58,  1.86s/it]
 26%|██▌       | 33/128 [01:04<02:42,  1.72s/it]
 27%|██▋       | 34/128 [01:12<05:35,  3.57s/it]
 27%|██▋       | 35/128 [01:14<04:45,  3.07s/it]
 28%|██▊       | 36/128 [01:17<04:38,  3.03s/it]
 29%|██▉       | 37/128 [01:18<03:39,  2.41s/it]
 30%|██▉       | 38/128 [01:21<04:00,  2.67s/it]
 30%|███       | 39/128 [01:26<04:39,  3.14s/it]
 31%|███▏      | 40/128 [01:27<03:51,  2.63s/it]
 32%|███▏      | 41/128 [01:29<03:31,  2.43s/it]
 33%|███▎      | 42/128 [01:40<07:16,  5.07s/it]
 34%|███▎      | 43/128 [01:44<06:30,  4.60s/it]
 34%|███▍      | 44/128 [01:45<04:50,  3.46s/it]
 35%|███▌      | 45/128 [01:49<05:00,  3.62s/it]
 36%|███▌      | 46/128 [01:50<04:02,  2.96s/it]
 37%|███▋      | 47/128 [01:50<02:53,  2.14s/it]
 38%|███▊      | 48/128 [01:56<04:25,  3.32s/it]
 38%|███▊      | 49/128 [01:58<03:39,  2.78s/it]
 39%|███▉      | 50/128 [01:58<02:44,  2.11s/it]
 40%|███▉      | 51/128 [01:59<02:14,  1.74s/it]
 41%|████      | 52/128 [02:00<01:44,  1.38s/it]
 41%|████▏     | 53/128 [02:01<01:43,  1.38s/it]
 42%|████▏     | 54/128 [02:02<01:25,  1.15s/it]
 43%|████▎     | 55/128 [02:03<01:19,  1.09s/it]
 44%|████▍     | 56/128 [02:04<01:27,  1.22s/it]
 45%|████▍     | 57/128 [02:04<01:03,  1.12it/s]
 45%|████▌     | 58/128 [02:06<01:27,  1.25s/it]
 46%|████▌     | 59/128 [02:07<01:08,  1.01it/s]
 47%|████▋     | 60/128 [02:09<01:33,  1.38s/it]
 48%|████▊     | 61/128 [02:12<02:07,  1.91s/it]
 48%|████▊     | 62/128 [02:14<01:57,  1.78s/it]
 49%|████▉     | 63/128 [02:15<01:48,  1.67s/it]
 50%|█████     | 64/128 [02:17<01:44,  1.64s/it]
 51%|█████     | 65/128 [02:18<01:37,  1.55s/it]
 52%|█████▏    | 66/128 [02:18<01:10,  1.14s/it]
 52%|█████▏    | 67/128 [02:20<01:22,  1.35s/it]
 53%|█████▎    | 68/128 [02:23<01:45,  1.76s/it]
 54%|█████▍    | 69/128 [02:25<01:44,  1.78s/it]
 55%|█████▍    | 70/128 [02:32<03:17,  3.41s/it]
 55%|█████▌    | 71/128 [02:34<02:54,  3.06s/it]
 56%|█████▋    | 72/128 [02:40<03:37,  3.89s/it]
 57%|█████▋    | 73/128 [02:40<02:38,  2.87s/it]
 58%|█████▊    | 74/128 [02:42<02:11,  2.43s/it]
 59%|█████▊    | 75/128 [02:45<02:17,  2.60s/it]
 59%|█████▉    | 76/128 [02:46<01:58,  2.28s/it]
 60%|██████    | 77/128 [02:47<01:24,  1.65s/it]
 61%|██████    | 78/128 [02:53<02:37,  3.15s/it]
 62%|██████▏   | 79/128 [02:55<02:09,  2.64s/it]
 62%|██████▎   | 80/128 [02:58<02:12,  2.75s/it]
 63%|██████▎   | 81/128 [03:01<02:16,  2.90s/it]
 64%|██████▍   | 82/128 [03:06<02:46,  3.63s/it]
 65%|██████▍   | 83/128 [03:09<02:27,  3.29s/it]
 66%|██████▌   | 84/128 [03:12<02:27,  3.36s/it]
 66%|██████▋   | 85/128 [03:14<01:59,  2.79s/it]
 67%|██████▋   | 86/128 [03:14<01:26,  2.05s/it]
 68%|██████▊   | 87/128 [03:20<02:07,  3.12s/it]
 69%|██████▉   | 88/128 [03:21<01:44,  2.61s/it]
 70%|██████▉   | 89/128 [03:29<02:49,  4.34s/it]
 70%|███████   | 90/128 [03:32<02:26,  3.86s/it]
 71%|███████   | 91/128 [03:35<02:07,  3.43s/it]
 72%|███████▏  | 92/128 [03:35<01:29,  2.50s/it]
 73%|███████▎  | 93/128 [03:42<02:19,  3.99s/it]
 73%|███████▎  | 94/128 [03:44<01:50,  3.24s/it]
 74%|███████▍  | 95/128 [03:46<01:35,  2.91s/it]
 75%|███████▌  | 96/128 [03:47<01:17,  2.43s/it]
 76%|███████▌  | 97/128 [03:48<00:58,  1.90s/it]
 77%|███████▋  | 98/128 [03:54<01:32,  3.09s/it]
 77%|███████▋  | 99/128 [03:56<01:21,  2.80s/it]
 78%|███████▊  | 100/128 [03:56<00:55,  1.99s/it]
 79%|███████▉  | 101/128 [03:58<00:56,  2.09s/it]
 80%|███████▉  | 102/128 [03:59<00:45,  1.76s/it]
 80%|████████  | 103/128 [04:01<00:44,  1.80s/it]
 81%|████████▏ | 104/128 [04:07<01:09,  2.88s/it]
 82%|████████▏ | 105/128 [04:08<00:53,  2.34s/it]
 83%|████████▎ | 106/128 [04:14<01:15,  3.45s/it]
 84%|████████▎ | 107/128 [04:16<01:06,  3.17s/it]
 84%|████████▍ | 108/128 [04:18<00:52,  2.64s/it]
 85%|████████▌ | 109/128 [04:23<01:04,  3.39s/it]
 86%|████████▌ | 110/128 [04:26<00:58,  3.26s/it]
 87%|████████▋ | 111/128 [04:41<01:54,  6.74s/it]
 88%|████████▊ | 112/128 [04:41<01:18,  4.89s/it]
 88%|████████▊ | 113/128 [04:43<00:57,  3.84s/it]
 89%|████████▉ | 114/128 [04:48<01:01,  4.37s/it]
 90%|████████▉ | 115/128 [04:51<00:51,  3.98s/it]
 91%|█████████ | 116/128 [04:53<00:38,  3.21s/it]
 91%|█████████▏| 117/128 [04:55<00:31,  2.90s/it]
 92%|█████████▏| 118/128 [04:58<00:30,  3.09s/it]
 93%|█████████▎| 119/128 [05:05<00:36,  4.09s/it]
 94%|█████████▍| 120/128 [05:08<00:30,  3.82s/it]
 95%|█████████▍| 121/128 [05:08<00:19,  2.78s/it]
 95%|█████████▌| 122/128 [05:10<00:13,  2.31s/it]
 96%|█████████▌| 123/128 [05:10<00:08,  1.68s/it]
 97%|█████████▋| 124/128 [05:11<00:06,  1.58s/it]
 98%|█████████▊| 125/128 [05:13<00:04,  1.52s/it]
 98%|█████████▊| 126/128 [05:14<00:03,  1.53s/it]
 99%|█████████▉| 127/128 [05:16<00:01,  1.65s/it]
100%|██████████| 128/128 [05:18<00:00,  1.76s/it]
100%|██████████| 128/128 [05:21<00:00,  2.51s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    0.4       
Max request concurrency:                 64        
Successful requests:                     128       
Benchmark duration (s):                  321.52    
Total input tokens:                      4096000   
Total input text tokens:                 4096000   
Total generated tokens:                  128       
Total generated tokens (retokenized):    128       
Request throughput (req/s):              0.40      
Input token throughput (tok/s):          12739.60  
Output token throughput (tok/s):         0.40      
Peak output token throughput (tok/s):    2.00      
Peak concurrent requests:                8         
Total token throughput (tok/s):          12740.00  
Concurrency:                             0.93      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   2330.52   
Median E2E Latency (ms):                 1669.88   
P90 E2E Latency (ms):                    3368.79   
P95 E2E Latency (ms):                    5549.97   
P99 E2E Latency (ms):                    8027.94   
---------------Time to First Token----------------
Mean TTFT (ms):                          2330.51   
Median TTFT (ms):                        1669.86   
P90 TTFT (ms):                           3368.77   
P95 TTFT (ms):                           5549.95   
P99 TTFT (ms):                           8027.92   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P90 TPOT (ms):                           0.00      
P95 TPOT (ms):                           0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P90 ITL (ms):                            0.00      
P95 ITL (ms):                            0.00      
P99 ITL (ms):                            0.00      
Max ITL (ms):                            0.00      
==================================================

# [collect_metrics] 文件原始修改时间: 2026-07-30 19:41:31
# [collect_metrics] 源目录日期: 20260730